class CodeUtil {
  /// 具体业务错误码
  static String codeString(int code) {
    String key = code.toString() != null ? code.toString() : "";
    return codeMap[key];
  }

  static Map codeMap = {
    "": "未找到对应错误",
    "-1": "未知错误（预留）",
    "0": "成功",
    "405": "已被对方加入黑名单，消息发送失败。",
    "5004": "超时",
    "20604": "发送消息频率过高，1秒钟最多只允许发送5条消息",
    "22406": "当前用户不在该群组中",
    "22408": "当前用户在群组中已被禁言",
    "23406": "当前用户不在该聊天室中",
    "23408": "当前用户在该聊天室中已被禁言",
    "23409": "当前用户已被踢出并禁止加入聊天室。被禁止的时间取决于服务端调用踢出接口时传入的时间。",
    "23410": "聊天室不存在",
    "23411": "聊天室成员超限",
    "23412": "聊天室接口参数无效。请确认参数是否为空或者有效。",
    "23414": "聊天室云存储业务未开通",
    "23423": "超过聊天室的最大状态设置数，1 个聊天室默认最多设置 100 个",
    "23424": "聊天室中非法覆盖状态值，状态已存在，没有权限覆盖",
    "23425": "超过聊天室中状态设置频率，1 个聊天室 1 秒钟最多设置和删除状态 100 次",
    "23426": "聊天室状态存储功能没有开通，请联系商务开通",
    "23427": "聊天室状态值不存在",
    "34004": "聊天室状态未同步完成",
    "30001": "当前连接不可用（连接已经被释放）",
    "30002": "当前连接不可用",
    "30003": "客户端发送消息请求，融云服务端响应超时。",
    "33001": "SDK没有初始化",
    "33002": "数据库错误",
    "33003": "开发者接口调用时传入的参数错误",
    "33007": "历史消息云存储业务未开通",
    "30016": "消息大小超限",
    "25101": "撤回消息参数无效",
    "26001": "push 设置参数无效",
    "20605": "操作被禁止",
    "20606": "操作不支持。仅私有云有效，服务端禁用了该操作。",
    "21501": "发送的消息中包含敏感词",
    "21502": "消息中敏感词已经被替换",
    "34002": "小视频时间长度超出限制",
    "34003": "GIF 消息文件大小超出限制",
  };
}
